//==============================================================================
//
//  ## @file
//  Syntax Extension Test UNI File for EDK II v1.40.
// 
//==============================================================================

#langdef en-US "English"
#langdef fr-FR "Français"
#string STR_MODULE_ABSTRACT             #language en-US "This is a basic abstract string."
                                        #language fr-FR "Ceci est un résumé de base."

#string STR_COMPACT_IDENTIFIER          #language en-US "Testing compact format" // Trailing comment
#string STR_URL_TEST                    #language en-US "Visit http://tianocore.org for info" 

#string STR_ESCAPE_TEST                 #language en-US "Escaped \" quotes and // slash inside string" // Real comment starts here
#string STR_MULTI_LINE_TEST
#string STR_SPECIAL_CHARS               #language en-US "Wide chars: \wide, Hex: \x0024, Return: \r\n"

#language en-US "Line 1\r\n"
#language fr-FR "Ligne 1\r\n"
